FAIRSEQ_LANGUAGE_CODES = ["<en_XX>", "<prog_PY>", "<prog_JAVA>", "<prog_JS>"]

"""
whitespace = [
    '\t', '\t\t', '\t' * 3, '\t' * 4, '\t' * 5,
    '\n', '\n\n',
    '\r\n', '\r\n\r\n',
    ' ' * 3, ' ' * 5, ' ' * 7, ' ' * 9, ' ' * 11, ' ' * 13, ' ' * 15,
    ' ' * 2, ' ' * 4, ' ' * 6, ' ' * 8, ' ' * 10, ' ' * 12, ' ' * 14, ' ' * 16
]
"""
USER_DEFINED_SYMBOLS = [
    "ĉ",
    "ĉĉ",
    "ĉĉĉ",
    "ĉĉĉĉ",
    "ĉĉĉĉĉ",
    "Ċ",
    "ĊĊ",
    "čĊ",
    "čĊčĊ",
    "ĠĠĠ",
    "ĠĠĠĠĠ",
    "ĠĠĠĠĠĠĠ",
    "ĠĠĠĠĠĠĠĠĠ",
    "ĠĠĠĠĠĠĠĠĠĠĠ",
    "ĠĠĠĠĠĠĠĠĠĠĠĠĠ",
    "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ",
    "ĠĠ",
    "ĠĠĠĠ",
    "ĠĠĠĠĠĠ",
    "ĠĠĠĠĠĠĠĠ",
    "ĠĠĠĠĠĠĠĠĠĠ",
    "ĠĠĠĠĠĠĠĠĠĠĠĠ",
    "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ",
    "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ",
]

